benchmark_results/results/qwen35b/Qwen_Qwen3.5-35B-A3B-FP8_in20000_out5000_rate150.log
DEBUG 04-14 08:44:54 [plugins/__init__.py:36] No plugins for group vllm.platform_plugins found.
DEBUG 04-14 08:44:54 [platforms/__init__.py:36] Checking if TPU platform is available.
DEBUG 04-14 08:44:54 [platforms/__init__.py:55] TPU platform is not available because: No module named 'libtpu'
DEBUG 04-14 08:44:54 [platforms/__init__.py:61] Checking if CUDA platform is available.
DEBUG 04-14 08:44:54 [platforms/__init__.py:84] Confirmed CUDA platform is available.
DEBUG 04-14 08:44:54 [platforms/__init__.py:112] Checking if ROCm platform is available.
DEBUG 04-14 08:44:54 [platforms/__init__.py:126] ROCm platform is not available because: No module named 'amdsmi'
DEBUG 04-14 08:44:54 [platforms/__init__.py:133] Checking if XPU platform is available.
DEBUG 04-14 08:44:54 [platforms/__init__.py:155] Checking if CPU platform is available.
DEBUG 04-14 08:44:54 [platforms/__init__.py:61] Checking if CUDA platform is available.
DEBUG 04-14 08:44:54 [platforms/__init__.py:84] Confirmed CUDA platform is available.
DEBUG 04-14 08:44:54 [platforms/__init__.py:220] Automatically detected platform cuda.
DEBUG 04-14 08:44:57 [utils/import_utils.py:74] Loading module triton_kernels from /usr/local/lib/python3.12/dist-packages/vllm/third_party/triton_kernels/__init__.py.
DEBUG 04-14 08:44:59 [entrypoints/utils.py:180] Setting VLLM_WORKER_MULTIPROC_METHOD to 'spawn'
DEBUG 04-14 08:44:59 [plugins/__init__.py:44] Available plugins for group vllm.general_plugins:
DEBUG 04-14 08:44:59 [plugins/__init__.py:46] - lora_filesystem_resolver -> vllm.plugins.lora_resolvers.filesystem_resolver:register_filesystem_resolver
DEBUG 04-14 08:44:59 [plugins/__init__.py:46] - lora_hf_hub_resolver -> vllm.plugins.lora_resolvers.hf_hub_resolver:register_hf_hub_resolver
DEBUG 04-14 08:44:59 [plugins/__init__.py:49] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7ff98877f100>, trust_remote_code=False, seed=0, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://10.29.95.16:8092/vllm-qwen3-5-35b-1', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=150, model='Qwen/Qwen3.5-35B-A3B-FP8', input_len=20000, output_len=5000, tokenizer='/Models/Qwen3.5-35B-A3B-FP8', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-7daaf18c-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
DEBUG 04-14 08:44:59 [tokenizers/registry.py:67] Loading CachedHfTokenizer for tokenizer_mode='hf'
INFO 04-14 08:45:00 [benchmarks/datasets.py:631] Sampling input_len from [20000, 20000] and output_len from [5000, 5000]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 150

  0%|          | 0/500 [00:00<?, ?it/s]
  0%|          | 1/500 [02:57<24:37:39, 177.67s/it]
  0%|          | 2/500 [03:08<11:00:58, 79.64s/it] 
  1%|          | 4/500 [03:08<4:06:04, 29.77s/it] 
  1%|          | 6/500 [03:09<2:10:31, 15.85s/it]
  1%|▏         | 7/500 [03:09<1:38:10, 11.95s/it]
  2%|▏         | 8/500 [03:10<1:12:49,  8.88s/it]
  2%|▏         | 9/500 [03:10<53:33,  6.54s/it]  
  2%|▏         | 10/500 [03:11<39:15,  4.81s/it]
  2%|▏         | 11/500 [03:11<28:49,  3.54s/it]
  2%|▏         | 12/500 [03:11<21:15,  2.61s/it]
  3%|▎         | 13/500 [03:12<15:52,  1.96s/it]
  3%|▎         | 14/500 [03:12<12:03,  1.49s/it]
  3%|▎         | 15/500 [03:12<09:22,  1.16s/it]
  3%|▎         | 16/500 [03:13<07:27,  1.08it/s]
  3%|▎         | 17/500 [03:13<06:07,  1.32it/s]
  4%|▎         | 18/500 [03:13<05:10,  1.55it/s]
  4%|▍         | 19/500 [03:14<04:30,  1.78it/s]
  4%|▍         | 20/500 [03:14<04:02,  1.98it/s]
  4%|▍         | 21/500 [03:15<03:42,  2.15it/s]
  4%|▍         | 22/500 [03:15<03:29,  2.28it/s]
  5%|▍         | 23/500 [03:15<03:19,  2.39it/s]
  5%|▍         | 24/500 [03:16<03:12,  2.48it/s]
  5%|▌         | 25/500 [03:16<03:08,  2.52it/s]
  5%|▌         | 26/500 [03:16<03:03,  2.58it/s]
  5%|▌         | 27/500 [03:17<03:01,  2.60it/s]
  6%|▌         | 28/500 [03:17<02:58,  2.64it/s]
  6%|▌         | 29/500 [03:18<02:58,  2.65it/s]
  6%|▌         | 30/500 [03:18<02:56,  2.66it/s]
  6%|▌         | 31/500 [03:18<02:56,  2.66it/s]
  6%|▋         | 32/500 [03:19<02:54,  2.68it/s]
  7%|▋         | 33/500 [03:19<02:53,  2.69it/s]
  7%|▋         | 34/500 [03:19<02:53,  2.68it/s]
  7%|▋         | 35/500 [03:20<02:52,  2.69it/s]
  7%|▋         | 36/500 [03:20<02:52,  2.69it/s]
  7%|▋         | 37/500 [03:21<02:52,  2.69it/s]
  8%|▊         | 38/500 [03:21<02:51,  2.70it/s]
  8%|▊         | 39/500 [03:21<02:51,  2.69it/s]
  8%|▊         | 40/500 [03:22<02:50,  2.70it/s]
  8%|▊         | 41/500 [03:22<02:49,  2.70it/s]
  8%|▊         | 42/500 [03:22<02:49,  2.70it/s]
  9%|▊         | 43/500 [03:23<02:49,  2.69it/s]
  9%|▉         | 44/500 [03:23<02:49,  2.70it/s]
  9%|▉         | 45/500 [03:24<02:49,  2.69it/s]
  9%|▉         | 46/500 [03:24<02:48,  2.70it/s]
  9%|▉         | 47/500 [03:24<02:48,  2.70it/s]
 10%|▉         | 48/500 [03:25<02:47,  2.70it/s]
 10%|▉         | 49/500 [03:25<02:47,  2.69it/s]
 10%|█         | 50/500 [03:25<02:47,  2.69it/s]
 10%|█         | 51/500 [03:26<02:46,  2.70it/s]
 10%|█         | 52/500 [03:26<02:45,  2.70it/s]
 11%|█         | 53/500 [03:26<02:45,  2.70it/s]
 11%|█         | 54/500 [03:27<02:45,  2.70it/s]
 11%|█         | 55/500 [03:27<02:44,  2.70it/s]
 11%|█         | 56/500 [03:28<02:44,  2.70it/s]
 11%|█▏        | 57/500 [03:28<02:44,  2.70it/s]
 12%|█▏        | 58/500 [03:28<02:43,  2.70it/s]
 12%|█▏        | 59/500 [03:29<02:43,  2.70it/s]
 12%|█▏        | 60/500 [03:29<02:42,  2.70it/s]
 12%|█▏        | 61/500 [03:29<02:42,  2.70it/s]
 12%|█▏        | 62/500 [03:30<02:41,  2.71it/s]
 13%|█▎        | 63/500 [03:30<02:42,  2.69it/s]
 13%|█▎        | 64/500 [03:31<02:41,  2.70it/s]
 13%|█▎        | 65/500 [03:31<02:40,  2.70it/s]
 13%|█▎        | 66/500 [03:31<02:40,  2.70it/s]
 13%|█▎        | 67/500 [03:32<02:42,  2.67it/s]
 14%|█▎        | 68/500 [03:32<02:38,  2.72it/s]
 14%|█▍        | 69/500 [03:32<02:39,  2.70it/s]
 14%|█▍        | 70/500 [03:33<02:40,  2.69it/s]
 14%|█▍        | 71/500 [03:33<02:37,  2.72it/s]
 14%|█▍        | 72/500 [03:34<02:37,  2.71it/s]
 15%|█▍        | 73/500 [03:34<02:37,  2.71it/s]
 15%|█▍        | 74/500 [03:34<02:37,  2.71it/s]
 15%|█▌        | 75/500 [03:35<02:36,  2.71it/s]
 15%|█▌        | 76/500 [03:35<02:36,  2.71it/s]
 15%|█▌        | 77/500 [03:35<02:36,  2.71it/s]
 16%|█▌        | 78/500 [03:36<02:36,  2.70it/s]
 16%|█▌        | 79/500 [03:36<02:35,  2.71it/s]
 16%|█▌        | 80/500 [03:36<02:34,  2.71it/s]
 16%|█▌        | 81/500 [03:37<02:35,  2.70it/s]
 16%|█▋        | 82/500 [03:37<02:34,  2.71it/s]
 17%|█▋        | 83/500 [03:38<02:34,  2.70it/s]
 17%|█▋        | 84/500 [03:38<02:33,  2.72it/s]
 17%|█▋        | 85/500 [03:38<02:33,  2.71it/s]
 17%|█▋        | 86/500 [03:39<02:32,  2.71it/s]
 17%|█▋        | 87/500 [03:39<02:33,  2.70it/s]
 18%|█▊        | 88/500 [03:39<02:31,  2.72it/s]
 18%|█▊        | 89/500 [03:40<02:31,  2.71it/s]
 18%|█▊        | 90/500 [03:40<02:31,  2.71it/s]
 18%|█▊        | 91/500 [03:41<02:31,  2.71it/s]
 18%|█▊        | 92/500 [03:41<02:30,  2.71it/s]
 19%|█▊        | 93/500 [03:41<02:30,  2.71it/s]
 19%|█▉        | 94/500 [03:42<02:30,  2.71it/s]
 19%|█▉        | 95/500 [03:42<02:29,  2.71it/s]
 19%|█▉        | 96/500 [03:42<02:28,  2.71it/s]
 19%|█▉        | 97/500 [03:43<02:28,  2.71it/s]
 20%|█▉        | 98/500 [03:43<02:28,  2.71it/s]
 20%|█▉        | 99/500 [03:43<02:27,  2.71it/s]
 20%|██        | 100/500 [03:44<02:28,  2.70it/s]
 20%|██        | 101/500 [03:44<02:26,  2.72it/s]
 20%|██        | 102/500 [03:45<02:26,  2.71it/s]
 21%|██        | 103/500 [03:45<02:26,  2.71it/s]
 21%|██        | 104/500 [03:45<02:25,  2.72it/s]
 21%|██        | 105/500 [03:46<02:25,  2.71it/s]
 21%|██        | 106/500 [03:46<02:25,  2.72it/s]
 21%|██▏       | 107/500 [03:46<02:24,  2.72it/s]
 22%|██▏       | 108/500 [03:47<02:24,  2.72it/s]
 22%|██▏       | 109/500 [03:47<02:24,  2.71it/s]
 22%|██▏       | 110/500 [03:48<02:23,  2.72it/s]
 22%|██▏       | 111/500 [03:48<02:23,  2.72it/s]
 22%|██▏       | 112/500 [03:48<02:22,  2.71it/s]
 23%|██▎       | 113/500 [03:49<02:22,  2.71it/s]
 23%|██▎       | 114/500 [03:49<02:22,  2.71it/s]
 23%|██▎       | 115/500 [03:49<02:21,  2.72it/s]
 23%|██▎       | 116/500 [03:50<02:22,  2.70it/s]
 23%|██▎       | 117/500 [03:50<02:20,  2.72it/s]
 24%|██▎       | 118/500 [03:50<02:20,  2.71it/s]
 24%|██▍       | 119/500 [03:51<02:20,  2.71it/s]
 24%|██▍       | 120/500 [03:51<02:20,  2.71it/s]
 24%|██▍       | 121/500 [03:52<02:19,  2.72it/s]
 24%|██▍       | 122/500 [03:52<02:18,  2.72it/s]
 25%|██▍       | 123/500 [03:52<02:22,  2.64it/s]
 25%|██▍       | 124/500 [03:53<02:33,  2.45it/s]
 25%|██▌       | 125/500 [03:53<02:30,  2.49it/s]
 25%|██▌       | 126/500 [03:54<02:26,  2.55it/s]
 25%|██▌       | 127/500 [03:54<02:23,  2.59it/s]
 26%|██▌       | 128/500 [03:54<02:22,  2.62it/s]
 26%|██▌       | 129/500 [03:55<02:20,  2.65it/s]
 26%|██▌       | 130/500 [03:55<02:18,  2.67it/s]
 26%|██▌       | 131/500 [03:55<02:18,  2.67it/s]
 26%|██▋       | 132/500 [03:56<02:16,  2.69it/s]
 27%|██▋       | 133/500 [03:56<02:15,  2.70it/s]
 27%|██▋       | 134/500 [03:57<02:15,  2.69it/s]
 27%|██▋       | 135/500 [03:57<02:15,  2.70it/s]
 27%|██▋       | 136/500 [03:57<02:14,  2.71it/s]
 27%|██▋       | 137/500 [03:58<02:14,  2.69it/s]
 28%|██▊       | 138/500 [03:58<02:13,  2.71it/s]
 28%|██▊       | 139/500 [03:58<02:13,  2.71it/s]
 28%|██▊       | 140/500 [03:59<02:12,  2.71it/s]
 28%|██▊       | 141/500 [03:59<02:12,  2.71it/s]
 28%|██▊       | 142/500 [04:00<02:12,  2.70it/s]
 29%|██▊       | 143/500 [04:00<02:12,  2.70it/s]
 29%|██▉       | 144/500 [04:00<02:11,  2.71it/s]
 29%|██▉       | 145/500 [04:01<02:11,  2.70it/s]
 29%|██▉       | 146/500 [04:01<02:10,  2.71it/s]
 29%|██▉       | 147/500 [04:01<02:10,  2.71it/s]
 30%|██▉       | 148/500 [04:02<02:09,  2.71it/s]
 30%|██▉       | 149/500 [04:02<02:09,  2.70it/s]
 30%|███       | 150/500 [04:02<02:08,  2.71it/s]
 30%|███       | 151/500 [06:15<3:52:24, 39.96s/it]
 30%|███       | 152/500 [06:26<3:01:31, 31.30s/it]
 31%|███       | 154/500 [06:26<1:37:25, 16.90s/it]
 31%|███       | 155/500 [06:26<1:13:26, 12.77s/it]
 31%|███       | 156/500 [06:27<54:38,  9.53s/it]  
 31%|███▏      | 157/500 [06:27<40:14,  7.04s/it]
 32%|███▏      | 158/500 [06:27<29:30,  5.18s/it]
 32%|███▏      | 159/500 [06:28<21:37,  3.80s/it]
 32%|███▏      | 160/500 [06:28<15:55,  2.81s/it]
 32%|███▏      | 161/500 [06:29<11:50,  2.10s/it]
 32%|███▏      | 162/500 [06:29<08:57,  1.59s/it]
 33%|███▎      | 163/500 [06:29<06:54,  1.23s/it]
 33%|███▎      | 164/500 [06:30<05:27,  1.03it/s]
 33%|███▎      | 165/500 [06:30<04:26,  1.26it/s]
 33%|███▎      | 166/500 [06:30<03:43,  1.49it/s]
 33%|███▎      | 167/500 [06:31<03:13,  1.72it/s]
 34%|███▎      | 168/500 [06:31<02:52,  1.93it/s]
 34%|███▍      | 169/500 [06:32<02:37,  2.10it/s]
 34%|███▍      | 170/500 [06:32<02:27,  2.24it/s]
 34%|███▍      | 171/500 [06:32<02:19,  2.35it/s]
 34%|███▍      | 172/500 [06:33<02:14,  2.44it/s]
 35%|███▍      | 173/500 [06:33<02:10,  2.51it/s]
 35%|███▍      | 174/500 [06:33<02:07,  2.55it/s]
 35%|███▌      | 175/500 [06:34<02:05,  2.59it/s]
 35%|███▌      | 176/500 [06:34<02:04,  2.61it/s]
 35%|███▌      | 177/500 [06:35<02:03,  2.62it/s]
 36%|███▌      | 178/500 [06:35<02:01,  2.64it/s]
 36%|███▌      | 179/500 [06:35<02:01,  2.64it/s]
 36%|███▌      | 180/500 [06:36<02:00,  2.65it/s]
 36%|███▌      | 181/500 [06:36<02:00,  2.65it/s]
 36%|███▋      | 182/500 [06:36<01:59,  2.66it/s]
 37%|███▋      | 183/500 [06:37<01:59,  2.66it/s]
 37%|███▋      | 184/500 [06:37<01:58,  2.66it/s]
 37%|███▋      | 185/500 [06:38<01:57,  2.68it/s]
 37%|███▋      | 186/500 [06:38<01:58,  2.65it/s]
 37%|███▋      | 187/500 [06:38<01:57,  2.67it/s]
 38%|███▊      | 188/500 [06:39<01:56,  2.68it/s]
 38%|███▊      | 189/500 [06:39<01:56,  2.67it/s]
 38%|███▊      | 190/500 [06:39<01:55,  2.68it/s]
 38%|███▊      | 191/500 [06:40<01:55,  2.68it/s]
 38%|███▊      | 192/500 [06:40<01:54,  2.68it/s]
 39%|███▊      | 193/500 [06:41<01:54,  2.67it/s]
 39%|███▉      | 194/500 [06:41<01:54,  2.67it/s]
 39%|███▉      | 195/500 [06:41<01:54,  2.67it/s]
 39%|███▉      | 196/500 [06:42<01:53,  2.67it/s]
 39%|███▉      | 197/500 [06:42<01:52,  2.68it/s]
 40%|███▉      | 198/500 [06:42<01:52,  2.68it/s]
 40%|███▉      | 199/500 [06:43<01:52,  2.68it/s]
 40%|████      | 200/500 [06:43<01:53,  2.64it/s]
 40%|████      | 201/500 [06:44<01:51,  2.67it/s]
 40%|████      | 202/500 [06:44<01:50,  2.69it/s]
 41%|████      | 203/500 [06:44<01:50,  2.68it/s]
 41%|████      | 204/500 [06:45<01:49,  2.69it/s]
 41%|████      | 205/500 [06:45<01:49,  2.69it/s]
 41%|████      | 206/500 [06:45<01:49,  2.69it/s]
 41%|████▏     | 207/500 [06:46<01:49,  2.68it/s]
 42%|████▏     | 208/500 [06:46<01:48,  2.69it/s]
 42%|████▏     | 209/500 [06:47<01:48,  2.68it/s]
 42%|████▏     | 210/500 [06:47<01:48,  2.68it/s]
 42%|████▏     | 211/500 [06:47<01:47,  2.68it/s]
 42%|████▏     | 212/500 [06:48<01:47,  2.68it/s]
 43%|████▎     | 213/500 [06:48<01:47,  2.68it/s]
 43%|████▎     | 214/500 [06:48<01:47,  2.67it/s]
 43%|████▎     | 215/500 [06:49<01:46,  2.68it/s]
 43%|████▎     | 216/500 [06:49<01:46,  2.68it/s]
 43%|████▎     | 217/500 [06:50<01:45,  2.69it/s]
 44%|████▎     | 218/500 [06:50<01:45,  2.69it/s]
 44%|████▍     | 219/500 [06:50<01:45,  2.67it/s]
 44%|████▍     | 220/500 [06:51<01:44,  2.69it/s]
 44%|████▍     | 221/500 [06:51<01:43,  2.69it/s]
 44%|████▍     | 222/500 [06:51<01:43,  2.68it/s]
 45%|████▍     | 223/500 [06:52<01:42,  2.69it/s]
 45%|████▍     | 224/500 [06:52<01:42,  2.68it/s]
 45%|████▌     | 225/500 [06:53<01:42,  2.69it/s]
 45%|████▌     | 226/500 [06:53<01:41,  2.69it/s]
 45%|████▌     | 227/500 [06:53<01:41,  2.68it/s]
 46%|████▌     | 228/500 [06:54<01:42,  2.66it/s]
 46%|████▌     | 229/500 [06:54<01:40,  2.69it/s]
 46%|████▌     | 230/500 [06:54<01:40,  2.68it/s]
 46%|████▌     | 231/500 [06:55<01:40,  2.68it/s]
 46%|████▋     | 232/500 [06:55<01:39,  2.68it/s]
 47%|████▋     | 233/500 [06:56<01:39,  2.68it/s]
 47%|████▋     | 234/500 [06:56<01:38,  2.69it/s]
 47%|████▋     | 235/500 [06:56<01:38,  2.68it/s]
 47%|████▋     | 236/500 [06:57<01:38,  2.69it/s]
 47%|████▋     | 237/500 [06:57<01:38,  2.68it/s]
 48%|████▊     | 238/500 [06:57<01:37,  2.69it/s]
 48%|████▊     | 239/500 [06:58<01:37,  2.68it/s]
 48%|████▊     | 240/500 [06:58<01:36,  2.69it/s]
 48%|████▊     | 241/500 [06:58<01:36,  2.68it/s]
 48%|████▊     | 242/500 [06:59<01:36,  2.69it/s]
 49%|████▊     | 243/500 [06:59<01:35,  2.69it/s]
 49%|████▉     | 244/500 [07:00<01:34,  2.70it/s]
 49%|████▉     | 245/500 [07:00<01:35,  2.68it/s]
 49%|████▉     | 246/500 [07:00<01:34,  2.69it/s]
 49%|████▉     | 247/500 [07:01<01:34,  2.69it/s]
 50%|████▉     | 248/500 [07:01<01:33,  2.69it/s]
 50%|████▉     | 249/500 [07:01<01:33,  2.68it/s]
 50%|█████     | 250/500 [07:02<01:32,  2.70it/s]
 50%|█████     | 251/500 [07:02<01:32,  2.69it/s]
 50%|█████     | 252/500 [07:03<01:32,  2.68it/s]
 51%|█████     | 253/500 [07:03<01:32,  2.68it/s]
 51%|█████     | 254/500 [07:03<01:31,  2.69it/s]
 51%|█████     | 255/500 [07:04<01:31,  2.69it/s]
 51%|█████     | 256/500 [07:04<01:30,  2.69it/s]
 51%|█████▏    | 257/500 [07:04<01:30,  2.69it/s]
 52%|█████▏    | 258/500 [07:05<01:29,  2.69it/s]
 52%|█████▏    | 259/500 [07:05<01:31,  2.65it/s]
 52%|█████▏    | 260/500 [07:06<01:28,  2.71it/s]
 52%|█████▏    | 261/500 [07:06<01:28,  2.70it/s]
 52%|█████▏    | 262/500 [07:06<01:28,  2.70it/s]
 53%|█████▎    | 263/500 [07:07<01:28,  2.69it/s]
 53%|█████▎    | 264/500 [07:07<01:27,  2.69it/s]
 53%|█████▎    | 265/500 [07:07<01:27,  2.69it/s]
 53%|█████▎    | 266/500 [07:08<01:27,  2.67it/s]
 53%|█████▎    | 267/500 [07:08<01:26,  2.68it/s]
 54%|█████▎    | 268/500 [07:09<01:25,  2.70it/s]
 54%|█████▍    | 269/500 [07:10<02:31,  1.52it/s]
 54%|█████▍    | 271/500 [07:10<01:31,  2.49it/s]
 55%|█████▍    | 273/500 [07:10<01:08,  3.29it/s]
 55%|█████▍    | 274/500 [07:11<01:13,  3.10it/s]
 55%|█████▌    | 275/500 [07:11<01:14,  3.03it/s]
 55%|█████▌    | 276/500 [07:11<01:16,  2.93it/s]
 55%|█████▌    | 277/500 [07:12<01:17,  2.87it/s]
 56%|█████▌    | 278/500 [07:12<01:18,  2.82it/s]
 56%|█████▌    | 279/500 [07:13<01:19,  2.79it/s]
 56%|█████▌    | 280/500 [07:13<01:19,  2.77it/s]
 56%|█████▌    | 281/500 [07:13<01:24,  2.60it/s]
 56%|█████▋    | 282/500 [07:14<01:21,  2.67it/s]
 57%|█████▋    | 283/500 [07:14<01:21,  2.65it/s]
 57%|█████▋    | 284/500 [07:15<01:22,  2.63it/s]
 57%|█████▋    | 285/500 [07:15<01:21,  2.62it/s]
 57%|█████▋    | 286/500 [07:15<01:21,  2.62it/s]
 57%|█████▋    | 287/500 [07:16<01:21,  2.61it/s]
 58%|█████▊    | 288/500 [07:16<01:21,  2.60it/s]
 58%|█████▊    | 289/500 [07:16<01:21,  2.60it/s]
 58%|█████▊    | 290/500 [07:17<01:20,  2.60it/s]
 58%|█████▊    | 291/500 [07:17<01:20,  2.60it/s]
 58%|█████▊    | 292/500 [07:18<01:20,  2.58it/s]
 59%|█████▊    | 293/500 [07:18<01:19,  2.60it/s]
 59%|█████▉    | 294/500 [07:18<01:19,  2.60it/s]
 59%|█████▉    | 295/500 [07:19<01:18,  2.60it/s]
 59%|█████▉    | 296/500 [07:19<01:18,  2.60it/s]
 59%|█████▉    | 297/500 [07:20<01:18,  2.59it/s]
 60%|█████▉    | 298/500 [07:20<01:17,  2.59it/s]
 60%|█████▉    | 299/500 [07:20<01:17,  2.60it/s]
 60%|██████    | 300/500 [07:21<01:17,  2.59it/s]
 60%|██████    | 301/500 [09:31<2:10:28, 39.34s/it]
 60%|██████    | 302/500 [09:42<1:41:36, 30.79s/it]
 61%|██████    | 304/500 [09:42<54:17, 16.62s/it]  
 61%|██████    | 305/500 [09:42<40:46, 12.55s/it]
 61%|██████    | 306/500 [09:43<30:17,  9.37s/it]
 61%|██████▏   | 307/500 [09:43<22:15,  6.92s/it]
 62%|██████▏   | 308/500 [09:43<16:17,  5.09s/it]
 62%|██████▏   | 309/500 [09:44<11:54,  3.74s/it]
 62%|██████▏   | 310/500 [09:44<08:45,  2.77s/it]
 62%|██████▏   | 311/500 [09:44<06:30,  2.07s/it]
 62%|██████▏   | 312/500 [09:45<04:54,  1.57s/it]
 63%|██████▎   | 313/500 [09:45<03:46,  1.21s/it]
 63%|██████▎   | 314/500 [09:46<02:59,  1.04it/s]
 63%|██████▎   | 315/500 [09:46<02:25,  1.27it/s]
 63%|██████▎   | 316/500 [09:46<02:02,  1.50it/s]
 63%|██████▎   | 317/500 [09:47<01:45,  1.73it/s]
 64%|██████▎   | 318/500 [09:47<01:33,  1.94it/s]
 64%|██████▍   | 319/500 [09:47<01:25,  2.11it/s]
 64%|██████▍   | 320/500 [09:48<01:20,  2.24it/s]
 64%|██████▍   | 321/500 [09:48<01:15,  2.36it/s]
 64%|██████▍   | 322/500 [09:48<01:12,  2.46it/s]
 65%|██████▍   | 323/500 [09:49<01:10,  2.53it/s]
 65%|██████▍   | 324/500 [09:49<01:08,  2.57it/s]
 65%|██████▌   | 325/500 [09:50<01:07,  2.60it/s]
 65%|██████▌   | 326/500 [09:50<01:06,  2.62it/s]
 65%|██████▌   | 327/500 [09:50<01:05,  2.63it/s]
 66%|██████▌   | 328/500 [09:51<01:04,  2.66it/s]
 66%|██████▌   | 329/500 [09:51<01:04,  2.65it/s]
 66%|██████▌   | 330/500 [09:51<01:03,  2.67it/s]
 66%|██████▌   | 331/500 [09:52<01:03,  2.68it/s]
 66%|██████▋   | 332/500 [09:52<01:02,  2.69it/s]
 67%|██████▋   | 333/500 [09:53<01:02,  2.68it/s]
 67%|██████▋   | 334/500 [09:53<01:01,  2.68it/s]
 67%|██████▋   | 335/500 [09:53<01:01,  2.69it/s]
 67%|██████▋   | 336/500 [09:54<01:00,  2.69it/s]
 67%|██████▋   | 337/500 [09:54<01:00,  2.68it/s]
 68%|██████▊   | 338/500 [09:54<01:00,  2.69it/s]
 68%|██████▊   | 339/500 [09:55<01:00,  2.68it/s]
 68%|██████▊   | 340/500 [09:55<00:59,  2.69it/s]
 68%|██████▊   | 341/500 [09:56<00:59,  2.69it/s]
 68%|██████▊   | 342/500 [09:56<00:58,  2.69it/s]
 69%|██████▊   | 343/500 [09:56<00:58,  2.69it/s]
 69%|██████▉   | 344/500 [09:57<00:57,  2.69it/s]
 69%|██████▉   | 345/500 [09:57<00:57,  2.69it/s]
 69%|██████▉   | 346/500 [09:57<00:57,  2.69it/s]
 69%|██████▉   | 347/500 [09:58<00:56,  2.69it/s]
 70%|██████▉   | 348/500 [09:58<00:56,  2.68it/s]
 70%|██████▉   | 349/500 [09:59<00:55,  2.71it/s]
 70%|███████   | 350/500 [09:59<00:55,  2.68it/s]
 70%|███████   | 351/500 [09:59<00:55,  2.69it/s]
 70%|███████   | 352/500 [10:00<00:54,  2.71it/s]
 71%|███████   | 353/500 [10:00<00:54,  2.70it/s]
 71%|███████   | 354/500 [10:00<00:51,  2.83it/s]
 71%|███████   | 356/500 [10:00<00:32,  4.43it/s]
 72%|███████▏  | 358/500 [10:01<00:24,  5.81it/s]
 72%|███████▏  | 360/500 [10:01<00:19,  7.07it/s]
 72%|███████▏  | 362/500 [10:01<00:17,  8.10it/s]
 73%|███████▎  | 364/500 [10:01<00:15,  8.88it/s]
 73%|███████▎  | 366/500 [10:01<00:14,  9.53it/s]
 74%|███████▎  | 368/500 [10:02<00:13, 10.07it/s]
 74%|███████▍  | 370/500 [10:02<00:11, 11.21it/s]
 74%|███████▍  | 372/500 [10:02<00:10, 11.88it/s]
 75%|███████▍  | 374/500 [10:02<00:09, 12.67it/s]
 75%|███████▌  | 376/500 [10:02<00:09, 13.32it/s]
 76%|███████▌  | 378/500 [10:02<00:08, 13.71it/s]
 76%|███████▌  | 380/500 [10:02<00:08, 14.46it/s]
 76%|███████▋  | 382/500 [10:02<00:08, 14.56it/s]
 77%|███████▋  | 384/500 [10:03<00:07, 14.87it/s]
 77%|███████▋  | 386/500 [10:03<00:07, 15.23it/s]
 78%|███████▊  | 388/500 [10:03<00:07, 15.39it/s]
 78%|███████▊  | 390/500 [10:03<00:07, 15.50it/s]
 78%|███████▊  | 392/500 [10:03<00:06, 15.63it/s]
 79%|███████▉  | 394/500 [10:03<00:06, 15.71it/s]
 79%|███████▉  | 396/500 [10:03<00:06, 15.93it/s]
 80%|███████▉  | 398/500 [10:03<00:06, 16.16it/s]
 80%|████████  | 400/500 [10:04<00:06, 16.23it/s]
 80%|████████  | 402/500 [10:04<00:05, 16.37it/s]
 81%|████████  | 404/500 [10:04<00:05, 16.41it/s]
 81%|████████  | 406/500 [10:04<00:05, 16.56it/s]
 82%|████████▏ | 408/500 [10:04<00:05, 16.67it/s]
 82%|████████▏ | 410/500 [10:04<00:05, 16.72it/s]
 82%|████████▏ | 412/500 [10:04<00:05, 16.85it/s]
 83%|████████▎ | 414/500 [10:04<00:05, 17.05it/s]
 83%|████████▎ | 416/500 [10:05<00:04, 17.01it/s]
 84%|████████▎ | 418/500 [10:05<00:04, 17.23it/s]
 84%|████████▍ | 420/500 [10:05<00:07, 11.11it/s]
 84%|████████▍ | 422/500 [10:05<00:06, 12.54it/s]
 85%|████████▍ | 424/500 [10:05<00:05, 13.74it/s]
 85%|████████▌ | 426/500 [10:05<00:05, 14.63it/s]
 86%|████████▌ | 428/500 [10:05<00:04, 15.48it/s]
 86%|████████▌ | 430/500 [10:06<00:04, 16.13it/s]
 86%|████████▋ | 432/500 [10:06<00:04, 16.60it/s]
 87%|████████▋ | 434/500 [10:06<00:03, 17.46it/s]
 87%|████████▋ | 436/500 [10:06<00:03, 18.01it/s]
 88%|████████▊ | 439/500 [10:06<00:03, 18.91it/s]
 88%|████████▊ | 442/500 [10:06<00:02, 20.11it/s]
 89%|████████▉ | 445/500 [10:06<00:02, 21.10it/s]
 90%|████████▉ | 448/500 [10:06<00:02, 21.70it/s]
 90%|█████████ | 450/500 [10:20<00:02, 21.70it/s]
 90%|█████████ | 451/500 [11:11<05:37,  6.88s/it]
 90%|█████████ | 452/500 [11:16<05:19,  6.65s/it]
 91%|█████████ | 455/500 [11:16<03:12,  4.27s/it]
 92%|█████████▏| 458/500 [11:16<01:59,  2.83s/it]
 92%|█████████▏| 461/500 [11:17<01:14,  1.92s/it]
 93%|█████████▎| 464/500 [11:17<00:47,  1.32s/it]
 93%|█████████▎| 467/500 [11:17<00:30,  1.09it/s]
 94%|█████████▍| 470/500 [11:17<00:19,  1.54it/s]
 95%|█████████▍| 474/500 [11:17<00:10,  2.38it/s]
 95%|█████████▌| 477/500 [11:17<00:07,  3.22it/s]
 96%|█████████▌| 481/500 [11:17<00:04,  4.73it/s]
 97%|█████████▋| 485/500 [11:17<00:02,  6.69it/s]
 98%|█████████▊| 490/500 [11:17<00:01,  9.77it/s]
 99%|█████████▉| 495/500 [11:18<00:00, 13.53it/s]
100%|██████████| 500/500 [11:18<00:00,  1.36s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Failed requests:                         0         
Maximum request concurrency:             150       
Benchmark duration (s):                  678.19    
Total input tokens:                      10000000  
Total generated tokens:                  2500000   
Request throughput (req/s):              0.74      
Output token throughput (tok/s):         3686.30   
Peak output token throughput (tok/s):    5539.00   
Peak concurrent requests:                155.00    
Total token throughput (tok/s):          18431.48  
---------------Time to First Token----------------
Mean TTFT (ms):                          8887.94   
Median TTFT (ms):                        1486.56   
P99 TTFT (ms):                           49488.43  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          35.93     
Median TPOT (ms):                        38.20     
P99 TPOT (ms):                           39.34     
---------------Inter-token Latency----------------
Mean ITL (ms):                           35.94     
Median ITL (ms):                         30.43     
P99 ITL (ms):                            146.35    
==================================================